Repository: TheJoeFin/Trdo
Catalog: Trdo/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, de_de, es_es, fr_fr, pl_pl, pt_pt, zh_cn

# NowPlayingPage_Label_Artist.Text
source: Artist
ar_sa: الفنان
de_de: Interpret
es_es: Artista
fr_fr: Artiste
pl_pl: Wykonawca
pt_pt: Artista
zh_cn: 艺术家

# NowPlayingPage_Label_Title.Text
source: Title
ar_sa: العنوان
de_de: Titel
es_es: Título
fr_fr: Titre
pl_pl: Tytuł
pt_pt: Título
zh_cn: 曲目

# NowPlayingPage_RecentTracks.Text
source: Recent Tracks
ar_sa: المقطوعات الأخيرة
de_de: Zuletzt gespielte Titel
es_es: Canciones recientes
fr_fr: Titres récents
pl_pl: Ostatnio odtwarzane utwory
pt_pt: Faixas recentes
zh_cn: 最近播放

# NowPlayingPage_Title.Text
source: Now Playing
ar_sa: قيد التشغيل الآن
de_de: Läuft gerade
es_es: Reproduciendo ahora
fr_fr: En Cours
pl_pl: Teraz odtwarzane
pt_pt: A reproduzir agora
zh_cn: 正在播放

source: Favorite Song
ar_sa: إضافة الأغنية إلى المفضلة
de_de: Song favorisieren
es_es: Canción favorita
fr_fr: TODO Titre favori
pl_pl: Ulubiony utwór
pt_pt: Adicionar aos favoritos
zh_cn: 收藏歌曲

source: Music search settings
ar_sa: إعدادات البحث عن الموسيقى
de_de: Musiksuche-Einstellungen
es_es: Configuración de búsqueda musical
fr_fr: Paramètres de recherche titres
pl_pl: Ustawienia wyszukiwarek muzyki
pt_pt: Definições de pesquisa de música
zh_cn: 音乐搜索设置

# PlaybackFailure_NoDetail
source: Couldn't play this station. The stream may be unavailable or the URL may be wrong.
ar_sa: تعذّر تشغيل هذه المحطة. قد يكون البث غير متاح أو الرابط غير صحيح.
de_de: Dieser Sender konnte nicht abgespielt werden. Der Stream ist möglicherweise nicht verfügbar oder die URL ist falsch.
es_es: No se pudo reproducir esta estación. Es posible que la transmisión no esté disponible o que la URL sea incorrecta.
fr_fr: TODO Impossible de lire cette station. Le flux peut être indisponible ou l'URL peut être incorrecte.
pl_pl: Nie można odtworzyć tej stacji. Strumień może być niedostępny lub adres URL jest nieprawidłowy.
pt_pt: Não foi possível reproduzir esta estação. O stream pode estar indisponível ou o URL pode estar incorreto.
zh_cn: 无法播放此电台。流媒体可能不可用，或网址有误。

# PlaybackFailure_NoNetwork
source: No internet connection. Connect to a network and try again.
ar_sa: لا يوجد اتصال بالإنترنت. اتصل بشبكة وحاول مرة أخرى.
de_de: Keine Internetverbindung. Verbinde dich mit einem Netzwerk und versuche es erneut.
es_es: Sin conexión a internet. Conéctate a una red e inténtalo de nuevo.
fr_fr: TODO Pas de connexion Internet. Connectez-vous à un réseau et réessayez.
pl_pl: Brak połączenia z Internetem. Połącz się z siecią i spróbuj ponownie.
pt_pt: Sem ligação à Internet. Ligue-se a uma rede e tente novamente.
zh_cn: 没有网络连接。请连接网络后重试。

# PlaybackFailure_TooManyAttemptsNoDetail
source: Couldn't play this station after several attempts. The stream may be offline or the URL may be wrong.
ar_sa: تعذّر تشغيل هذه المحطة بعد عدة محاولات. قد يكون البث غير متصل أو الرابط غير صحيح.
de_de: Dieser Sender konnte nach mehreren Versuchen nicht abgespielt werden. Der Stream ist möglicherweise offline oder die URL ist falsch.
es_es: No se pudo reproducir esta estación después de varios intentos. Es posible que la transmisión esté fuera de línea o que la URL sea incorrecta.
fr_fr: TODO Impossible de lire cette station après plusieurs tentatives. Le flux peut être hors ligne ou l'URL peut être incorrecte.
pl_pl: Nie można odtworzyć tej stacji po kilku próbach. Strumień może być niedostępny lub adres URL jest nieprawidłowy.
pt_pt: Não foi possível reproduzir esta estação após várias tentativas. O stream pode estar offline ou o URL pode estar incorreto.
zh_cn: 多次尝试后仍无法播放此电台。流媒体可能已离线，或网址有误。

# PlaybackFailure_TooManyAttemptsWithDetail
source: Couldn't play this station after several attempts ({0}). The stream may be offline or the URL may be wrong.
ar_sa: تعذّر تشغيل هذه المحطة بعد عدة محاولات ({0}). قد يكون البث غير متصل أو الرابط غير صحيح.
de_de: Dieser Sender konnte nach mehreren Versuchen ({0}) nicht abgespielt werden. Der Stream ist möglicherweise offline oder die URL ist falsch.
es_es: No se pudo reproducir esta estación después de varios intentos ({0}). Es posible que la transmisión esté fuera de línea o que la URL sea incorrecta.
fr_fr: TODO Impossible de lire cette station après plusieurs tentatives ({0}). Le flux peut être hors ligne ou l'URL peut être incorrecte.
pl_pl: Nie można odtworzyć tej stacji po kilku próbach ({0}). Strumień może być niedostępny lub adres URL jest nieprawidłowy.
pt_pt: Não foi possível reproduzir esta estação após várias tentativas ({0}). O stream pode estar offline ou o URL pode estar incorreto.
zh_cn: 多次尝试后仍无法播放此电台（{0}）。流媒体可能已离线，或网址有误。

# PlaybackFailure_WithDetail
source: Couldn't play this station: {0}
ar_sa: تعذّر تشغيل هذه المحطة: {0}
de_de: Dieser Sender konnte nicht abgespielt werden: {0}
es_es: No se pudo reproducir esta estación: {0}
fr_fr: TODO Impossible de lire cette station : {0}
pl_pl: Nie można odtworzyć tej stacji: {0}
pt_pt: Não foi possível reproduzir esta estação: {0}
zh_cn: 无法播放此电台：{0}

# PlaybackFailure_WithSentenceDetail
source: Couldn't play this station. {0}
ar_sa: تعذّر تشغيل هذه المحطة. {0}
de_de: Dieser Sender konnte nicht abgespielt werden. {0}
es_es: No se pudo reproducir esta estación. {0}
fr_fr: TODO Impossible de lire cette station. {0}
pl_pl: Nie można odtworzyć tej stacji. {0}
pt_pt: Não foi possível reproduzir esta estação. {0}
zh_cn: 无法播放此电台。{0}

# PlayerViewModel_Buffering
source: Buffering
ar_sa: جارٍ التخزين المؤقت
de_de: Puffern
es_es: Almacenando en búfer
fr_fr: TODO Mise en tampon
pl_pl: Buforowanie
pt_pt: A colocar em buffer
zh_cn: 缓冲中

# PlayerViewModel_FailedToInitializeStream
source: Failed to initialize stream: {0}
ar_sa: فشل تهيئة البث: {0}
de_de: Stream konnte nicht initialisiert werden: {0}
es_es: Error al inicializar la transmisión: {0}
fr_fr: TODO Impossible d'initialiser le flux : {0}
pl_pl: Nie można zainicjować strumienia {0}
pt_pt: Falha ao inicializar o stream: {0}
zh_cn: 初始化流媒体失败：{0}

# PlayerViewModel_FailedToPause
source: Failed to pause {0}: {1}
ar_sa: فشل إيقاف {0} مؤقتًا: {1}
de_de: {0} konnte nicht pausiert werden: {1}
es_es: Error al pausar {0}: {1}
fr_fr: TODO Impossible de mettre en pause {0} : {1}
pl_pl: Nie udało się wstrzymać {0}: {1}
pt_pt: Falha ao pausar {0}: {1}
zh_cn: 暂停 {0} 失败：{1}

# PlayerViewModel_FailedToPlay
source: Failed to play {0}: {1}
ar_sa: فشل تشغيل {0}: {1}
de_de: {0} konnte nicht abgespielt werden: {1}
es_es: Error al reproducir {0}: {1}
fr_fr: TODO Impossible de lire {0} : {1}
pl_pl: Nie udało się odtworzyć {0}: {1}
pt_pt: Falha ao reproduzir {0}: {1}
zh_cn: 播放 {0} 失败：{1}

# PlayerViewModel_FailedToRestore
source: Failed to restore {0}: {1}
ar_sa: فشل استعادة {0}: {1}
de_de: {0} konnte nicht wiederhergestellt werden: {1}
es_es: Error al restaurar {0}: {1}
fr_fr: TODO Impossible de restaurer {0} : {1}
pl_pl: Nie udało się przywrócić {0}: {1}
pt_pt: Falha ao restaurar {0}: {1}
zh_cn: 恢复 {0} 失败：{1}

# PlayerViewModel_FailedToSwitch
source: Failed to switch to {0}: {1}
ar_sa: فشل التبديل إلى {0}: {1}
de_de: Wechsel zu {0} fehlgeschlagen: {1}
es_es: Error al cambiar a {0}: {1}
fr_fr: TODO Impossible de basculer vers {0} : {1}
pl_pl: Nie udało się przełączyć na {0}: {1}
pt_pt: Falha ao mudar para {0}: {1}
zh_cn: 切换到 {0} 失败：{1}

# PlayerViewModel_FailedToUpdateStream
source: Failed to update stream: {0}
ar_sa: فشل تحديث البث: {0}
de_de: Stream konnte nicht aktualisiert werden: {0}
es_es: Error al actualizar la transmisión: {0}
fr_fr: TODO Impossible de mettre à jour le flux : {0}
pl_pl: Nie udało się zaktualizować strumienia: {0}
pt_pt: Falha ao atualizar o stream: {0}
zh_cn: 更新流媒体失败：{0}

# PlayerViewModel_InvalidStreamUrl
source: Invalid stream URL for {0}
ar_sa: رابط بث غير صالح لـ {0}
de_de: Ungültige Stream-URL für {0}
es_es: URL de transmisión no válida para {0}
fr_fr: TODO URL de flux invalide pour {0}
pl_pl: Nieprawidłowy adres URL strumienia dla {0}
pt_pt: URL de stream inválido para {0}
zh_cn: {0} 的流媒体网址无效

# PlayerViewModel_Pause
source: Pause
ar_sa: إيقاف مؤقت
es_es: Pausa
fr_fr: TODO Pause
pl_pl: Zatrzymaj
pt_pt: Pausar
zh_cn: 暂停

# PlayerViewModel_PauseAndClose
source: Pause & close
ar_sa: إيقاف مؤقت وإغلاق
de_de: Pausieren & schließen
es_es: Pausar y cerrar
fr_fr: TODO Pause & fermer
pl_pl: Zatrzymaj & zamknij
pt_pt: Pausar e fechar
zh_cn: 暂停并关闭

# PlayerViewModel_Play
source: Play
ar_sa: تشغيل
de_de: Abspielen
es_es: Reproducir
fr_fr: TODO Lire
pl_pl: Odtwarzaj
pt_pt: Reproduzir
zh_cn: 播放

# PlayingPage_About.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: About Traydio
ar_sa: حول Traydio
de_de: Über Traydio
es_es: Acerca de Traydio
fr_fr: À propos de Traydio
pl_pl: O Traydio
pt_pt: Acerca do Traydio
zh_cn: 关于 Traydio

# PlayingPage_AddFirstStation.Text
source: Add Your First Station
ar_sa: أضف محطتك الأولى
de_de: Füge deinen ersten Sender hinzu
es_es: Añadir tu primera estación
fr_fr: Ajoutez votre première station
pl_pl: Dodaj swoją pierwszą stację radiową
pt_pt: Adicione a sua primeira estação
zh_cn: 添加您的第一个电台

# PlayingPage_DeleteGroup.Text
source: Delete group
ar_sa: حذف المجموعة
de_de: Gruppe löschen
es_es: Eliminar grupo
fr_fr: Supprimer le groupe
pl_pl: Usuń grupę
pt_pt: Eliminar grupo
zh_cn: 删除分组

# PlayingPage_DeleteGroupAndStations.Text
source: Delete group and its stations
ar_sa: حذف المجموعة ومحطاتها
de_de: Gruppe und ihre Sender löschen
es_es: Eliminar el grupo y sus estaciones
fr_fr: Supprimer le groupe et ses stations
pl_pl: Usuń grupę i należące do niej stacje
pt_pt: Eliminar grupo e as suas estações
zh_cn: 删除分组及其电台

# PlayingPage_Edit.Text
source: Edit
ar_sa: تعديل
de_de: Bearbeiten
es_es: Editar
fr_fr: Modifier
pl_pl: Edytuj
pt_pt: Editar
zh_cn: 编辑

# PlayingPage_EditLabel.Text
source: Edit label
ar_sa: تعديل التسمية
de_de: Bezeichnung bearbeiten
es_es: Editar etiqueta
fr_fr: Modifier l'étiquette
pl_pl: Edytuj etykietę
pt_pt: Editar etiqueta
zh_cn: 编辑标签

# PlayingPage_EmptySubtitle.Text
source: Get started by adding your favorite radio station to begin listening.
ar_sa: ابدأ بإضافة محطتك الإذاعية المفضّلة لبدء الاستماع.
de_de: Füge deinen Lieblingssender hinzu, um mit dem Hören zu beginnen.
es_es: Empieza agregando tu estación de radio favorita para comenzar a escuchar.
fr_fr: Commencez en ajoutant votre station de radio favorite pour écouter.
pl_pl: Zacznij od dodania swojej ulubionej stacji radiowej, aby rozpocząć słuchanie.
pt_pt: Comece por adicionar a sua estação de rádio favorita para começar a ouvir.
zh_cn: 添加您喜欢的电台即可开始收听。

# PlayingPage_EmptyTitle.Text
source: No Stations Yet
ar_sa: لا توجد محطات بعد
de_de: Noch keine Sender
es_es: Aún no hay estaciones
fr_fr: Aucune station pour l'instant
pl_pl: Brak stacji radiowej
pt_pt: Ainda não há estações
zh_cn: 暂无电台

# PlayingPage_Favorites.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Favorite Songs
ar_sa: الأغاني المفضّلة
de_de: Lieblingssongs
es_es: Canciones favoritas
fr_fr: Titres favoris
pl_pl: Ulubione utwory
pt_pt: Músicas favoritas
zh_cn: 收藏的歌曲

# PlayingPage_GroupBy.Text
source: Group by
ar_sa: التجميع حسب
de_de: Gruppieren nach
es_es: Agrupar por
fr_fr: Grouper par
pl_pl: Grupowanie
pt_pt: Agrupar por
zh_cn: 分组方式

# PlayingPage_HideVolumeSlider
source: Hide Volume Slider
ar_sa: إخفاء منزلق الصوت
de_de: Lautstärkeregler ausblenden
es_es: Ocultar control de volumen
fr_fr: Masquer le curseur de volume
pl_pl: Ukryj suwak głośności
pt_pt: Ocultar controlo de volume
zh_cn: 隐藏音量滑块

# PlayingPage_InsertDividerAbove.Text
source: Insert divider above
ar_sa: إدراج فاصل أعلاه
de_de: Trennlinie darüber einfügen
es_es: Insertar separador arriba
fr_fr: Insérer un séparateur au-dessus
pl_pl: Wstaw separator powyżej
pt_pt: Inserir divisória acima
zh_cn: 在上方插入分隔线

# PlayingPage_Manual.Content
source: Manual
ar_sa: يدوي
de_de: Manuell
fr_fr: Manuel
pl_pl: Ręcznie
zh_cn: 手动

# PlayingPage_MoveToGroup.Text
source: Move to group
ar_sa: نقل إلى مجموعة
de_de: In Gruppe verschieben
es_es: Mover al grupo
fr_fr: Déplacer vers le groupe
pl_pl: Przenieś do grupy
pt_pt: Mover para grupo
zh_cn: 移动到分组

# PlayingPage_NewDivider.Text
source: New Divider
ar_sa: فاصل جديد
de_de: Neue Trennlinie
es_es: Nuevo separador
fr_fr: Nouveau séparateur
pl_pl: Nowy separator
pt_pt: Nova divisória
zh_cn: 新建分隔线

# PlayingPage_NewGroup.Text
source: New Group
ar_sa: مجموعة جديدة
de_de: Neue Gruppe
es_es: Nuevo grupo
fr_fr: Nouveau groupe
pl_pl: Nowa grupa
pt_pt: Novo grupo
zh_cn: 新建分组

# PlayingPage_PlaybackErrorClose
source: OK
ar_sa: موافق
es_es: Aceptar
fr_fr: TODO OK
zh_cn: 确定

# PlayingPage_PlaybackErrorTitle
source: Playback Error
ar_sa: خطأ في التشغيل
de_de: Wiedergabefehler
es_es: Error de reproducción
fr_fr: TODO Erreur de lecture
pl_pl: Błąd odtwarzania
pt_pt: Erro de reprodução
zh_cn: 播放错误

source: Open mini player
ar_sa: فتح المشغّل المصغّر
de_de: Mini-Player öffnen
es_es: Abrir mini reproductor
fr_fr: TODO Ouvrir le mini lecteur
pl_pl: Otwórz miniodtwarzacz
pt_pt: Abrir mini-leitor
zh_cn: 打开迷你播放器

# PlayingPage_QuitButton.Content
source: Quit
ar_sa: إنهاء
de_de: Beenden
es_es: Salir
fr_fr: TODO Quitter
pl_pl: Zakończ
pt_pt: Sair
zh_cn: 退出

# PlayingPage_QuitButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Quit Traydio
ar_sa: إنهاء Traydio
de_de: Traydio beenden
es_es: Salir de Traydio
fr_fr: TODO Quitter Traydio
pl_pl: Zamknij Traydio
pt_pt: Sair do Traydio
zh_cn: 退出 Traydio

# PlayingPage_RefreshAllInfo.Text
source: Refresh info for all stations
ar_sa: تحديث معلومات جميع المحطات
de_de: Informationen für alle Sender aktualisieren
es_es: Actualizar información de todas las estaciones
fr_fr: Actualiser les infos de toutes les stations
pl_pl: Odśwież informacje o wszystkich stacjach
pt_pt: Atualizar informação de todas as estações
zh_cn: 刷新所有电台的信息

# PlayingPage_RefreshStationInfo.Text
source: Refresh station info
ar_sa: تحديث معلومات المحطة
de_de: Senderinformationen aktualisieren
es_es: Actualizar información de la estación
fr_fr: Actualiser les infos de la station
pl_pl: Odśwież informacje o stacji
pt_pt: Atualizar informação da estação
zh_cn: 刷新电台信息

# PlayingPage_Remove.Text
source: Remove
ar_sa: إزالة
de_de: Entfernen
es_es: Eliminar
fr_fr: Supprimer
pl_pl: Usuń
pt_pt: Remover
zh_cn: 移除

# PlayingPage_RemoveDivider.Text
source: Remove divider
ar_sa: إزالة الفاصل
de_de: Trennlinie entfernen
es_es: Eliminar separador
fr_fr: Supprimer le séparateur
pl_pl: Usuń separator
pt_pt: Remover divisória
zh_cn: 移除分隔线

# PlayingPage_Rename.Text
source: Rename
ar_sa: إعادة تسمية
de_de: Umbenennen
es_es: Cambiar nombre
fr_fr: Renommer
pl_pl: Zmień nazwę
pt_pt: Renomear
zh_cn: 重命名

# PlayingPage_Settings.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Settings
ar_sa: الإعدادات
de_de: Einstellungen
es_es: Configuración
fr_fr: Paramètres
pl_pl: Ustawienia
pt_pt: Definições
zh_cn: 设置

# PlayingPage_ShowVolume.Text
source: Show Volume Slider
ar_sa: إظهار منزلق الصوت
de_de: Lautstärkeregler anzeigen
es_es: Mostrar control de volumen
fr_fr: Afficher le curseur de volume
pl_pl: Pokaż suwak głośności
pt_pt: Mostrar controlo de volume
zh_cn: 显示音量滑块

# PlayingPage_SortBy.Text
source: Sort by
ar_sa: الترتيب حسب
de_de: Sortieren nach
es_es: Ordenar por
fr_fr: Trier par
pl_pl: Sortowanie
pt_pt: Ordenar por
zh_cn: 排序方式

# PlayingPage_StationButton.Text
source: Station
ar_sa: محطة
de_de: Sender
es_es: Estación
pl_pl: Stacja
pt_pt: Estação
zh_cn: 电台

# PlayingPage_StationsHeader.Text
source: Stations
ar_sa: المحطات
de_de: Sender
es_es: Estaciones
pl_pl: Stacje
pt_pt: Estações
zh_cn: 电台

# PlayingPage_VisitWebsite.Text
source: Visit Website
ar_sa: زيارة الموقع الإلكتروني
de_de: Website besuchen
es_es: Visitar sitio web
fr_fr: Visiter le site Web
pl_pl: Odwiedź stronę internetową
pt_pt: Visitar sítio Web
zh_cn: 访问网站

# SettingsPage_AllowSleepDescription.Text
source: Let the computer go to sleep on its normal schedule while radio is playing. Note that Windows itself may keep the PC awake while any audio is playing.
ar_sa: السماح للكمبيوتر بالدخول في وضع السكون وفق جدوله المعتاد أثناء تشغيل الراديو. لاحظ أن نظام Windows نفسه قد يبقي الكمبيوتر نشطًا أثناء تشغيل أي صوت.
de_de: Lässt den Computer während der Radiowiedergabe nach dem normalen Zeitplan in den Ruhezustand wechseln. Beachte, dass Windows selbst den PC wach halten kann, solange Audio abgespielt wird.
es_es: Permite que el equipo entre en suspensión según su programación normal mientras la radio está reproduciéndose. Ten en cuenta que Windows puede mantener el PC despierto mientras haya audio en reproducción.
fr_fr: Autoriser l'ordinateur à se mettre en veille selon son planning habituel pendant que la radio joue. Notez que Windows peut empêcher la mise en veille tant qu'un flux audio est en cours de lecture.
pl_pl: Pozwól komputerowi przejść w tryb uśpienia zgodnie z normalnym harmonogramem podczas odtwarzania radia. Pamiętaj, że sam system Windows może utrzymywać komputer aktywny podczas odtwarzania dowolnego dźwięku.
pt_pt: Permite que o computador entre em suspensão de acordo com o seu horário normal enquanto o rádio está a tocar. Note que o próprio Windows pode manter o PC ativo enquanto qualquer áudio estiver a ser reproduzido.
zh_cn: 允许电脑在播放电台时按正常计划进入睡眠。请注意，只要有音频在播放，Windows 本身可能会让电脑保持唤醒状态。

# SettingsPage_AllowSleepTitle.Text
source: Allow PC to sleep
ar_sa: السماح للكمبيوتر بالسكون
de_de: PC in den Ruhezustand versetzen zulassen
es_es: Permitir que el PC duerma
fr_fr: Autoriser la mise en veille du PC
pl_pl: Zezwól komputerowi na przejście w tryb uśpienia
pt_pt: Permitir que o PC suspenda
zh_cn: 允许电脑睡眠

# SettingsPage_AutoIncreaseBufferDescription.Text
source: Let Traydio raise the buffer automatically when the stream is struggling to stay smooth.
ar_sa: السماح لـ Traydio بزيادة التخزين المؤقت تلقائيًا عندما يواجه البث صعوبة في الاستمرار بسلاسة.
de_de: Lässt Traydio den Puffer automatisch erhöhen, wenn der Stream Schwierigkeiten hat, flüssig zu bleiben.
es_es: Permite que Traydio aumente el búfer automáticamente cuando la transmisión tiene problemas para seguir fluida.
fr_fr: Laisser Traydio augmenter automatiquement le tampon lorsque le flux a du mal à rester fluide.
pl_pl: Pozwól Traydio automatycznie zwiększać bufor, gdy strumień ma problemy z płynnym odtwarzaniem.
pt_pt: Permite que o Traydio aumente o buffer automaticamente quando o stream está com dificuldade em manter-se estável.
zh_cn: 当流媒体播放不流畅时，让 Traydio 自动提高缓冲。

# SettingsPage_AutoIncreaseBufferTitle.Text
source: Auto-increase buffer on stutter
ar_sa: زيادة التخزين المؤقت تلقائيًا عند التقطّع
de_de: Puffer bei Rucklern automatisch erhöhen
es_es: Aumentar el búfer automáticamente al trabarse
fr_fr: Augmenter automatiquement le tampon en cas de saccade
pl_pl: Automatycznie zwiększaj bufor przy zacinaniu
pt_pt: Aumentar automaticamente o buffer em caso de interrupções
zh_cn: 卡顿时自动增加缓冲

# SettingsPage_AutoPlayWarning.Message
source: This means audio will begin playing when Traydio is launched. It could be disruptive. Are you sure you want to enable this?
ar_sa: هذا يعني أن الصوت سيبدأ بالتشغيل عند تشغيل Traydio. قد يكون هذا مزعجًا. هل تريد بالتأكيد تفعيل هذا الخيار؟
de_de: Das bedeutet, dass die Audiowiedergabe beginnt, sobald Traydio gestartet wird. Dies könnte störend sein. Bist du sicher, dass du dies aktivieren möchtest?
es_es: Esto hace que el audio comience a reproducirse cuando se inicia Traydio. Puede resultar molesto. ¿Seguro que quieres habilitarlo?
fr_fr: Cela signifie que l'audio commencera à jouer lorsque Traydio sera lancé. Cela peut être dérangeant. Voulez-vous vraiment activer cette option ?
pl_pl: Oznacza to, że dźwięk zacznie być odtwarzany po uruchomieniu Traydio. Może to być uciążliwe. Czy na pewno chcesz włączyć tę opcję?
pt_pt: Isto significa que o áudio começará a tocar assim que o Traydio for iniciado. Pode ser incómodo. Tem a certeza de que quer ativar isto?
zh_cn: 这意味着 Traydio 启动时会自动开始播放音频，可能会造成干扰。您确定要启用此功能吗？

# SettingsPage_AutoRecoverDescription.Text
source: Monitor playback and automatically try to recover when a stream stalls, drops out, or goes silent.
ar_sa: مراقبة التشغيل ومحاولة الاستعادة تلقائيًا عندما يتعطل البث أو ينقطع أو يصمت.
de_de: Überwacht die Wiedergabe und versucht automatisch, sich zu erholen, wenn ein Stream stockt, abbricht oder verstummt.
es_es: Supervisa la reproducción y intenta recuperarse automáticamente si la transmisión se atasca, cae o se queda en silencio.
fr_fr: Surveiller la lecture et tenter automatiquement de la relancer lorsqu'un flux se bloque, coupe ou devient muet.
pl_pl: Monitoruj odtwarzanie i automatycznie próbuj je przywrócić, gdy strumień się zatrzyma, zostanie przerwany lub przestanie odtwarzać dźwięk.
pt_pt: Monitoriza a reprodução e tenta recuperar automaticamente quando um stream encrava, cai ou fica em silêncio.
zh_cn: 监控播放状态，并在流媒体卡顿、中断或无声时自动尝试恢复。

# SettingsPage_AutoRecoverTitle.Text
source: Auto-recover
ar_sa: الاستعادة التلقائية
de_de: Automatische Wiederherstellung
es_es: Recuperación automática
fr_fr: Relance automatique
pl_pl: Automatyczne przywracanie
pt_pt: Recuperação automática
zh_cn: 自动恢复

# SettingsPage_BufferLevelDescription.Text
source: Higher buffer levels help on unstable connections, but they can add a little more playback delay.
ar_sa: تساعد مستويات التخزين المؤقت الأعلى في حالة الاتصالات غير المستقرة، لكنها قد تزيد من تأخير التشغيل قليلًا.
de_de: Höhere Pufferstufen helfen bei instabilen Verbindungen, können aber etwas mehr Wiedergabeverzögerung verursachen.
es_es: Los niveles altos de búfer ayudan en conexiones inestables, pero pueden añadir un poco más de retardo de reproducción.
fr_fr: Des niveaux de tampon plus élevés aident sur les connexions instables, mais peuvent ajouter un peu de délai de lecture.
pl_pl: Wyższy poziom bufora pomaga przy niestabilnych połączeniach, ale może powodować nieco większe opóźnienie odtwarzania.
pt_pt: Níveis de buffer mais elevados ajudam em ligações instáveis, mas podem acrescentar um pouco mais de atraso na reprodução.
zh_cn: 较高的缓冲级别有助于应对不稳定的网络连接，但可能会增加一些播放延迟。

# SettingsPage_BufferLevelTitle.Text
source: Buffer level
ar_sa: مستوى التخزين المؤقت
de_de: Pufferstufe
es_es: Nivel del búfer
fr_fr: Niveau du tampon
pl_pl: Poziom bufora
pt_pt: Nível do buffer
zh_cn: 缓冲级别

# SettingsPage_CopyDiagnostics.Content
source: Copy diagnostics
ar_sa: نسخ التشخيصات
de_de: Diagnose kopieren
es_es: Copiar diagnósticos
fr_fr: Copier les diagnostics
pl_pl: Kopiuj informacje diagnostyczne
pt_pt: Copiar diagnóstico
zh_cn: 复制诊断信息

# SettingsPage_CopyDiagnosticsFailed
source: Couldn't copy diagnostics: {0}
ar_sa: تعذّر نسخ التشخيصات: {0}
de_de: Diagnose konnte nicht kopiert werden: {0}
es_es: No se pudieron copiar los diagnósticos: {0}
fr_fr: TODO Impossible de copier les diagnostics : {0}
pl_pl: Nie udało się skopiować informacji diagnostycznych: {0}
pt_pt: Não foi possível copiar o diagnóstico: {0}
zh_cn: 无法复制诊断信息：{0}

source: Demo the song change popup
ar_sa: عرض توضيحي للنافذة المنبثقة لتغيير الأغنية
de_de: Popup für Songwechsel demonstrieren
es_es: Ver demostración del popup
fr_fr: Afficher une démo du popup de changement de piste
pl_pl: Pokaż podgląd wyskakującego okna zmiany utworu
pt_pt: Demonstrar o popup de mudança de música
zh_cn: 演示歌曲切换弹窗

source: Show the popup now, so you can see what it looks like
ar_sa: إظهار النافذة المنبثقة الآن لترى شكلها
de_de: Popup jetzt anzeigen, damit du siehst, wie es aussieht
es_es: Muestra el popup ahora para ver cómo se ve
fr_fr: Afficher le popup maintenant pour voir à quoi il ressemble
pl_pl: Pokaż teraz wyskakujące okno, aby zobaczyć, jak wygląda
pt_pt: Mostrar o popup agora, para que veja como fica
zh_cn: 立即显示弹窗，以便查看其效果

# SettingsPage_DemoPopupButton.Content
source: Demo
ar_sa: عرض توضيحي
es_es: Demostración
fr_fr: Démo
pl_pl: Podgląd
pt_pt: Demonstração
zh_cn: 演示
